#include <stdlib.h>
#include <math.h>
#include <stdio.h>

double f(double x){              //συναρτηση f(x)=cosx-x,ψαχνω ριζες της εξισωσης f(x)=0
	return cos(x)-x;
}


////////////////////////////////////////////////////////////////
int main() {
	
	
	int i=0;                                   //αρχικοποιηση επαναληψης i
	double x1,x,x0, error;                     //οριζω x1=xn,x=xn+1,x0=xn-1, σφαλμα επαναληψης
	x0=0.8;                                 //αρχικες συνθηκες συμφωνα με το f(x0)*f(x1)<0,αριστερα-δεξια της ριζας
	x1=0.6;
	printf("   i	   x0	       x                 x1	        error\n\n");
	do{                                                //επανελαβε οσο το σφαλμα >= 0.5x10^-8 (ακριβεια 8 δεκαδικων)
		i=i+1;                                      //αυξηση επαναληψης κατα 1
		
		x=x1 - (x1-x0)/(f(x1)-f(x0))*f(x1);                   //μεθοδος εσφαλμενης θεσης
		error=fabs(x-x1);                                //ορισμος σφαλματος
		printf("\n %3d %14.8f %14.8f %14.8f %14.8f",i,x0,x,x1,error);     //εκτυπωση επαναληψης,xn-1,xn+1,xn, σφαλμα
		x0=x1;
		x1=x;                                                  
	}while(   error>=0.5*pow(10.0,-8.0)     );
	
	printf("\n\n ROOT: %14.8f \n\n",x);                        //εκτυπωση ριζας
	return 0;
}

