#include <stdlib.h>
#include <math.h>
#include <stdio.h>

#define L 10                        //τιμη πηνιου
#define C 5*pow(10,-5)               //τιμη πυκνωτη

double q(double t){                    //συναρτηση q(t)
	double a;                   //σταθερα a
	a=pow( ((1/(L*C))-pow(R/(2*L),2)), 0.5 );
	return q0*exp((-R*t)/(2*L))*cos(a*t);
}




////////////////////////////////////////////////////////////////
int main() {
	
	
	int i=0;                                   //αρχικοποιηση επαναληψης i
	
	double q0=q(0);              //αρχικη τιμη της q για t=0
	double v0=q0/C;            //q0=v0*C, αρα ταση v0=q0/C
	double t, error;                     //οριζω x, σφαλμα επαναληψης
	double x0=1.0;                             //αρχικη συνθηκη
	printf("   i		x	   f(x)	     error\n\n");
	do{                                                //επανελαβε οσο το σφαλμα >= 0.5x10^-6 (ακριβεια 6 δεκαδικων)
		i=i+1;                                      //αυξηση επαναληψης κατα 1
		t=t - q(t)/df(x0);                          //μεθοδος N-R
		error=fabs(x-x0);                                //ορισμος σφαλματος
		printf("\n %3d %14.8f %14.8f %14.8f",i,x,f(x),error);     //εκτυπωση επαναληψης, προσεγγισης, τιμης της f στην προσεγγιση, σφαλμα
		x0=x;                                                           //νεο x0=προηγουμενη προσεγγιση
	}while(   (error>=0.5*pow(10.0,-6.0)) && ()       );
	
	printf("\n\n ROOT: %14.8f \n\n",x);                        //εκτυπωση ριζας
	return 0;
}

