#include <stdlib.h>
#include <math.h>
#include <stdio.h>

double g(double x)
{ //συναρτηση g
	return pow(x, 3) - pow(x, 2) + 1 + x;
}

////////////////////////////////////////////////////////////////
int main()
{

	int i = 0;		 //αρχικοποιηση επαναληψης i
	double x, error; //οριζω x, σφαλμα επαναληψης
	double x0 = 0.5; //αρχικη συνθηκη
	printf("   i		x0	   x	     error\n\n");
	do
	{															//επανελαβε οσο το σφαλμα >= 0.5x10^-5 (ακριβεια 5 δεκαδικων)
		i = i + 1;												//αυξηση επαναληψης κατα 1
		x = g(x0);												//επαναληπτικη μεθοδος
		error = fabs(x - x0);									//ορισμος σφαλματος
		printf("\n %3d %14.5f %14.5f %14.5f", i, x0, x, error); //εκτυπωση επαναληψης,παλιας προσεγγισης,νεας προσεγγισης , σφαλμα
		x0 = x;													//νεο x0=προηγουμενη προσεγγιση
	} while (error >= 0.5 * pow(10.0, -5.0));

	printf("\n\n ROOT: %14.5f \n\n", x); //εκτυπωση ριζας
	return 0;
}
